v12_30MPa_design/v12_testing_phase2/cfd/sidepod_airflow/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|   \\  /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)           // 0
    (2 0 0)           // 1
    (2 0.4 0)         // 2
    (0 0.4 0)         // 3
    (0 0 0.3)         // 4
    (2 0 0.3)         // 5
    (2 0.4 0.3)       // 6
    (0 0.4 0.3)       // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 8 6) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    sidepod_wall
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }

    symmetry
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //