v12_30MPa_design/v12_testing_phase2/cfd/sidepod_airflow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|   \\  /   O peration     | Version:  v2312                                 |
|    \\/    A nd           | Website:  www.openfoam.com                      |
|     \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (30 0 0);  // 30 m/s = 108 km/h

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (30 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    sidepod_wall
    {
        type            noSlip;
    }

    intercooler
    {
        type            noSlip;
    }

    symmetry
    {
        type            symmetry;
    }
}

// ************************************************************************* //