v12_30MPa_design/v12_testing_phase2/cfd/sidepod_airflow/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|   \\  /   O peration     | Version:  v2312                                 |
|    \\/    A nd           | Website:  www.openfoam.com                      |
|     \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    sidepod_wall
    {
        type            zeroGradient;
    }

    intercooler
    {
        type            zeroGradient;
    }

    symmetry
    {
        type            symmetry;
    }
}

// ************************************************************************* //