v12_30MPa_design/v12_testing_phase2/cfd/sidepod_airflow/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|   \\  /   O peration     | Version:  v2312                                 |
|    \\/    A nd           | Website:  www.openfoam.com                      |
|     \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 36.3;  // ε = Cμ^0.75 * k^1.5 / L, Cμ=0.09, L=0.028 m

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 36.3;
    }

    outlet
    {
        type            zeroGradient;
    }

    sidepod_wall
    {
        type            epsilonWallFunction;
        value           uniform 36.3;
    }

    intercooler
    {
        type            epsilonWallFunction;
        value           uniform 36.3;
    }

    symmetry
    {
        type            symmetry;
    }
}

// ************************************************************************* //